#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
  
```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.fiap_burger_identity: Reading...
aws_apigatewayv2_api.fiap_burger: Refreshing state... [id=w8x793xbk4]
data.terraform_remote_state.fiap_burger_identity: Read complete after 0s
aws_apigatewayv2_stage.dev: Refreshing state... [id=dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.fiap_burger_identity_integration will be created
  + resource "aws_apigatewayv2_integration" "fiap_burger_identity_integration" {
      + api_id                                    = "w8x793xbk4"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:287574492696:function:fiap_burger_identity/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.proxy_handler will be created
  + resource "aws_apigatewayv2_route" "proxy_handler" {
      + api_id             = "w8x793xbk4"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /identity"
      + target             = (known after apply)
    }

  # aws_lambda_permission.api_gtw will be created
  + resource "aws_lambda_permission" "api_gtw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "fiap_burger_identity"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:287574492696:w8x793xbk4/*/*/identity"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
  
</details>

*Pusher: @gm50x*
*Action: `pull_request`*
*Workflow: `Terraform IAC - API Gateway`*